In [3]:
import numpy as np
import pandas as pd

In [9]:
revenues = pd.Series([5555, 7000, 1980])
#print(revenues.values) #returns the values in the Series
#print(revenues.index) #returns the positional index

city_revenues = pd.Series([4200, 8000, 6500],
    index=["Amsterdam", "Toronto", "Tokyo"])
print(city_revenues)

city_employee_count = pd.Series({"Amsterdam": 5, "Tokyo": 8})
print(city_employee_count) #The dictionary keys become the index, and the dictionary values are the Series 


#print(city_employee_count.keys())
#print("Tokyo" in city_employee_count)
#print("New York" in city_employee_count)

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64
Amsterdam    5
Tokyo        8
dtype: int64

In [11]:
#dataframes
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "employee_count": city_employee_count})
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [13]:
city_data.index
city_data.values

array([[4.2e+03, 5.0e+00],
       [6.5e+03, 8.0e+00],
       [8.0e+03,     nan]])

In [14]:
city_data.axes

[Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object'),
 Index(['revenue', 'employee_count'], dtype='object')]

In [15]:
city_data.axes[0] #column

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [16]:
city_data.axes[1] #row

Index(['revenue', 'employee_count'], dtype='object')

In [17]:
city_data.keys()

Index(['revenue', 'employee_count'], dtype='object')

In [18]:
"Amsterdam" in city_data

False

In [19]:
"revenue" in city_data

True

In [21]:
print(city_revenues)
print(city_revenues["Toronto"])
print (city_revenues[1])
print (city_revenues[-1])
print (city_revenues[1:])
print (city_revenues["Toronto":])

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64
8000
8000
6500
Toronto    8000
Tokyo      6500
dtype: int64
Toronto    8000
Tokyo      6500
dtype: int64

In [26]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index=[1, 2, 3, 5, 8])
print (colors)
print (colors.loc[1]) #refers to the label index
print (colors.iloc[1]) #refers to the positional index
print (colors.loc[3:6]) #refers to the label index
print (colors.iloc[1:3]) #refers to the positional index
print (colors.iloc[-3])  #refers to the positional index

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object
red
purple
3     blue
5    green
dtype: object
2    purple
3      blue
dtype: object
blue

In [29]:
#Dataframe Element

print(city_data["revenue"])
print(city_data.revenue)
#return the same output

toys = pd.DataFrame([
    {"name": "ball", "shape": "sphere"},
    {"name": "Rubik's cube", "shape": "cube"}
])

print(toys)
print(toys["shape"])
toys.shape

Amsterdam    4200
Tokyo        6500
Toronto      8000
Name: revenue, dtype: int64
Amsterdam    4200
Tokyo        6500
Toronto      8000
Name: revenue, dtype: int64
           name   shape
0          ball  sphere
1  Rubik's cube    cube
0    sphere
1      cube
Name: shape, dtype: object

(2, 2)

In [33]:
city_data.loc["Amsterdam"]

revenue           4200.0
employee_count       5.0
Name: Amsterdam, dtype: float64

In [31]:
city_data.loc["Tokyo": "Toronto"]

         revenue  employee_count
Tokyo       6500             8.0
Toronto     8000             NaN

In [32]:
city_data.iloc[1]

revenue           6500.0
employee_count       8.0
Name: Tokyo, dtype: float64

In [34]:
city_data.loc["Amsterdam": "Tokyo", "revenue"] #baris, kolom untuk aturannya

Amsterdam    4200
Tokyo        6500
Name: revenue, dtype: int64

In [35]:
print(city_revenues.sum())
print(city_revenues.max())
print(city_revenues.min())
print(city_revenues.mean())

18700
8000
4200
6233.333333333333

In [38]:
# Filtering Dataframe
dataFrame = pd.DataFrame({"Product": ["SmartTV", "ChromeCast", "Speaker", "Earphone"],
                          "Opening_Stock": [300, 700, 1200, 1500],
                          "Closing_Stock": [200, 500, 1000, 900]})

print("DataFrame...\n",dataFrame)

DataFrame...
       Product  Opening_Stock  Closing_Stock
0     SmartTV            300            200
1  ChromeCast            700            500
2     Speaker           1200           1000
3    Earphone           1500            900

In [40]:
# using numpy where() to filter DataFrame with 2 Conditions
resValues1 = np.where((dataFrame['Opening_Stock']>=700) & (dataFrame['Closing_Stock']< 1000))
print("\nFiltered DataFrame Value = \n",dataFrame.loc[resValues1])

Filtered DataFrame Value =
       Product  Opening_Stock  Closing_Stock
1  ChromeCast            700            500
3    Earphone           1500            900

In [41]:
# using numpy where() to filter DataFrame with 3 conditions
resValues2 = np.where((dataFrame['Opening_Stock']>=500) & (dataFrame['Closing_Stock']< 1000) & (dataFrame['Product'].str.startswith('C')))

print("\nFiltered DataFrame Value = \n",dataFrame.loc[resValues2])

Filtered DataFrame Value =
       Product  Opening_Stock  Closing_Stock
1  ChromeCast            700            500

In [42]:
# Multiple dataset

further_city_data = pd.DataFrame(
    {"revenue": [7000, 3400], "employee_count": [2, 2]},
    index=["New York", "Barcelona"]
)

print (city_data)
print (further_city_data)

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
           revenue  employee_count
New York      7000               2
Barcelona     3400               2

In [44]:
all_city_data = pd.concat([city_data, further_city_data], sort=False) #concat to add data
all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

In [45]:
city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]},
    index=["Amsterdam", "Tokyo", "Rotterdam", "Toronto", "Barcelona"]
)

city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [47]:
cities = pd.concat([all_city_data, city_countries], axis=1, sort=False)
cities

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland      1.0
Tokyo       6500.0             8.0    Japan      1.0
Toronto     8000.0             NaN   Canada      0.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0

In [48]:
pd.concat([all_city_data, city_countries], axis=1, join="inner") #cities that appear on both dataset

           revenue  employee_count  country  capital
Amsterdam     4200             5.0  Holland        1
Tokyo         6500             8.0    Japan        1
Toronto       8000             NaN   Canada        0
Barcelona     3400             2.0    Spain        0

In [49]:
countries = pd.DataFrame({
    "population_millions": [17, 127, 37],
    "continent": ["Europe", "Asia", "North America"]
}, index=["Holland", "Japan", "Canada"])
countries

In [50]:
pd.merge(cities, countries, left_on="country", right_index=True) #only inner join, sorted index

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200.0,5.0,Holland,1.0,17,Europe
Rotterdam,NaN,NaN,Holland,0.0,17,Europe
Tokyo,6500.0,8.0,Japan,1.0,127,Asia
Toronto,8000.0,NaN,Canada,0.0,37,North America

In [51]:
pd.merge(
    cities,
    countries,
    left_on="country",
    right_index=True,
    how="left"
)
#If you want to include all cities in the result, then you need to provide the how parameter

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200.0,5.0,Holland,1.0,17.0,Europe
Tokyo,6500.0,8.0,Japan,1.0,127.0,Asia
Toronto,8000.0,NaN,Canada,0.0,37.0,North America
New York,7000.0,2.0,NaN,NaN,NaN,NaN
Barcelona,3400.0,2.0,Spain,0.0,NaN,NaN
Rotterdam,NaN,NaN,Holland,0.0,17.0,Europe